# StairsDbgShowRunRiser Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowRunRiser Property
ParameterTypeId Class See Also
---
"Show Run's Risers"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowRunRiser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowRunRiser As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowRunRiser {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace